SigninLogs
| project TimeGenerated, UserDisplayName, UserPrincipalName, Status, ResultType, AppDisplayName
| extend LocalTime = datetime_utc_to_local(TimeGenerated, 'Europe/Warsaw')
| summarize arg_max(LocalTime, *) by UserPrincipalName
| project LastLogin = LocalTime, 
          UserDisplayName, 
          UserPrincipalName, 
          Success = iff(ResultType == 0, "✅ Success", "❌ Failure"),
          ErrorCode = ResultType,
          ErrorReason = Status.failureReason,
          AppDisplayName
| sort by LastLogin desc
